# Дана электрическая цепь, состоящая из 2-х последовательно соединенных проводников (сопротивление каждого известно). Найти общее сопротивление цепи (округление результата необходимо выполнить до 1-го знака после запятой).

first_resistance = float(input())
second_resistance = float(input())
res = first_resistance + second_resistance
print(res)